# Wroking with Multiple Tables

In [1]:
%load_ext sql
%sql ibm_db_sa://mpc82210:7rf3d7vvlfj%5Egf7d@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB

In [6]:
%sql SELECT * FROM DEPARTMENTS

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[('2        ', 'Architect Group', '30001    ', 'L0001    '),
 ('5        ', 'Software Group', '30002    ', 'L0002    '),
 ('7        ', 'Design Team', '30003    ', 'L0003    ')]

### Multiple Tables with Sub-Queries in WHERE Clause (IN Operator)

In [4]:
%sql SELECT COUNT(*) FROM EMPLOYEES WHERE dep_id NOT IN (SELECT DEPT_ID_DEP FROM DEPARTMENTS)

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[(Decimal('0'),)]

In [10]:
%sql SELECT * FROM EMPLOYEES WHERE dep_id IN (SELECT dept_id_dep FROM DEPARTMENTS WHERE dep_name = 'Software Group')

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[('E1002    ', 'Alice', 'James', '123457   ', datetime.date(1972, 7, 31), 'F', '980 Berry ln, Elgin,IL', '200      ', Decimal('80000.00'), '30002    ', '5        '),
 ('E1003    ', 'Steve', 'Wells', '123458   ', datetime.date(1980, 8, 10), 'M', '291 Springs, Gary,IL', '300      ', Decimal('50000.00'), '30002    ', '5        '),
 ('E1004    ', 'Santosh', 'Kumar', '123459   ', datetime.date(1985, 7, 20), 'M', '511 Aurora Av, Aurora,IL', '400      ', Decimal('60000.00'), '30004    ', '5        '),
 ('E1010    ', 'Ann', 'Jacob', '123415   ', datetime.date(1982, 3, 30), 'F', '111 Britany Springs,Elgin,IL', '220      ', Decimal('70000.00'), '30004    ', '5        ')]

In [15]:
%sql SELECT DEPT_ID_DEP, DEP_NAME FROM DEPARTMENTS WHERE DEPT_ID_DEP IN (SELECT DEP_ID FROM EMPLOYEES WHERE salary > 70000)

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[('2        ', 'Architect Group'), ('5        ', 'Software Group')]

### Multiple Tables with Implict Join

#### Full or Cartesian Join

all rows are combined with all rows

In [18]:
%sql SELECT * FROM EMPLOYEES, DEPARTMENTS LIMIT 3

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[('E1001    ', 'John', 'Thomas', '123456   ', datetime.date(1976, 1, 9), 'M', '5631 Rice, OakPark,IL', '100      ', Decimal('100000.00'), '30001    ', '2        ', '2        ', 'Architect Group', '30001    ', 'L0001    '),
 ('E1002    ', 'Alice', 'James', '123457   ', datetime.date(1972, 7, 31), 'F', '980 Berry ln, Elgin,IL', '200      ', Decimal('80000.00'), '30002    ', '5        ', '2        ', 'Architect Group', '30001    ', 'L0001    '),
 ('E1003    ', 'Steve', 'Wells', '123458   ', datetime.date(1980, 8, 10), 'M', '291 Springs, Gary,IL', '300      ', Decimal('50000.00'), '30002    ', '5        ', '2        ', 'Architect Group', '30001    ', 'L0001    ')]

#### Limiting Results: When a column's values in Column with Unique Values

In [22]:
x = %sql SELECT * FROM EMPLOYEES, DEPARTMENTS WHERE EMPLOYEES.DEP_ID = DEPARTMENTS.DEPT_ID_DEP

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

#### Making Tables Names Shorter (Aliases)

In [23]:
y = %sql SELECT * FROM EMPLOYEES E, DEPARTMENTS D WHERE E.DEP_ID = D.DEPT_ID_DEP

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

In [24]:
x==y

True

#### Multiple Columns from Multiple Tables

With Shorter Tables Names

In [25]:
%sql SELECT F_NAME, DEP_NAME FROM EMPLOYEES E, DEPARTMENTS D WHERE E.DEP_ID = D.DEPT_ID_DEP

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[('John', 'Architect Group'),
 ('Alice', 'Software Group'),
 ('Steve', 'Software Group'),
 ('Santosh', 'Software Group'),
 ('Ahmed', 'Architect Group'),
 ('Nancy', 'Architect Group'),
 ('Mary', 'Design Team'),
 ('Bharath', 'Design Team'),
 ('Andrea', 'Design Team'),
 ('Ann', 'Software Group')]

Shorter Table Names Prefixing Columns Names

In [26]:
%sql SELECT E.F_NAME, E.L_NAME, D.DEP_NAME, D.LOC_ID FROM EMPLOYEES E, DEPARTMENTS D WHERE E.DEP_ID = D.DEPT_ID_DEP

 * ibm_db_sa://mpc82210:***@dashdb-txn-sbox-yp-dal09-10.services.dal.bluemix.net:50000/BLUDB
Done.

[('John', 'Thomas', 'Architect Group', 'L0001    '),
 ('Alice', 'James', 'Software Group', 'L0002    '),
 ('Steve', 'Wells', 'Software Group', 'L0002    '),
 ('Santosh', 'Kumar', 'Software Group', 'L0002    '),
 ('Ahmed', 'Hussain', 'Architect Group', 'L0001    '),
 ('Nancy', 'Allen', 'Architect Group', 'L0001    '),
 ('Mary', 'Thomas', 'Design Team', 'L0003    '),
 ('Bharath', 'Gupta', 'Design Team', 'L0003    '),
 ('Andrea', 'Jones', 'Design Team', 'L0003    '),
 ('Ann', 'Jacob', 'Software Group', 'L0002    ')]